# -*- coding: utf-8 -*-
import room_1
import room_2
# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

print('In the room room_1 live: ', *room_1.folks)
print('In the room room_1 live: ', *room_2.folks)


