#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['mama', 'papa', 'ded']
print(my_family[0], my_family[1], my_family[2])

# список списков приблизителного роста членов вашей семьи
my_family_height = [['mama', 'papa', 'ded'], [168, 188, 190], ['см']]
my_family_height[0][1] = 'отца'

print('Рост', my_family_height[0][1], my_family_height[1][1], my_family_height[2][0])

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см


